# Exercise

1. _How many rows and columns reflected on dataset file IMDB-database-update.csv?_

In [3]:
#Importing File
import pandas as pd
imdb = pd.read_csv("dataset/IMDB-database-update.csv", encoding='latin1')

In [4]:
#Initial Datashape 
imdb.shape

(3781, 36)

In [5]:
#Checking Missing Data
imdb.isnull().sum()

movie_ID                     0
movie_title                  0
duration                     0
color                        0
title_year                   0
country                      0
language                     0
content_rating               0
budget_USD                   0
gross_USD                    0
net_USD                      0
profitable                   0
director_name                0
director_top20?              0
director_facebook?           0
director_facebook_likes      0
actor_1_name                 0
actor_top20?                 0
actor_1_facebook?            0
actor_1_facebook_likes       0
actor_2_name                 0
actor_top20?.1               0
actor_2_facebook?            0
actor_2_facebook_likes       0
actor_3_name                 0
actor_top20?.2               0
actor_3_facebook?            0
actor_3_facebook_likes       0
cast_total_facebook_likes    0
movie_facebook?              0
movie_facebook_likes;        0
facenumber_in_poster         0
num_voted_users              0
num_user_for_reviews         0
imdb_score                   0
imdb_top_250                 0
dtype: int64

In [6]:
#Removing Duplicates based on Movie Title
imdb = imdb.drop_duplicates('movie_title')

In [7]:
#Datashape after duplicate removal
imdb.shape

(3679, 36)

2. _What are the top 3 movies with highest nett profit in 2016?_

In [25]:
#Sorting table Based on Net Profit
imdbprofit = imdb.sort_values(by=['net_USD'],ascending=False)

In [34]:
imdbprofit.head(3)[['movie_title','net_USD']]

       movie_title    net_USD
0           Avatar  523505847
14  Jurassic World  502177271
11         Titanic  458672302

In [42]:
imdbprofit2015 = imdbprofit[imdbprofit.title_year==2015]

In [43]:
imdbprofit2015.head(3)[['movie_title','net_USD']]

                  movie_title    net_USD
14             Jurassic World  502177271
256                   Minions  262029560
3384  Avengers: Age of Ultron  208991599

3. _What are the top 3 movies with highest gross profit in 2017?_

In [48]:
imdbgross = imdb.sort_values(by=['gross_USD'],ascending=False)

In [49]:
imdbgross2016 = imdbgross[imdbgross.title_year==2016]

In [50]:
imdbgross2016.head(3)[['movie_title','net_USD']]

                    movie_title    net_USD
12   Captain America: Civil War  157197282
355                    Deadpool  305024263
36              The Jungle Book  187645141

4. _How many non-english movies are in the dataset?_

In [57]:
imdb_non_english = imdb[imdb.language!="English"]

In [59]:
print(len(imdb_non_english))

152

5. _What are top 3 languages in the data set aside English (based on number of movies)?_

In [70]:
imdb_non_english.language.value_counts()

French        33
Spanish       23
Mandarin      13
Japanese      10
German        10
Cantonese      7
Portuguese     5
Hindi          5
Italian        5
Norwegian      4
Korean         4
Dutch          3
Persian        3
Danish         3
Thai           3
Indonesian     2
Dari           2
Hebrew         2
Aboriginal     2
Bosnian        1
Aramaic        1
Filipino       1
Maya           1
Vietnamese     1
Kazakh         1
Arabic         1
Russian        1
Zulu           1
None           1
Mongolian      1
Czech          1
Hungarian      1
Name: language, dtype: int64

6. _What are the top 3 countries with the highest nett profit in all dataset times?_

In [71]:
imdbprofit.head(3)[['movie_title','net_USD']]

       movie_title    net_USD
0           Avatar  523505847
14  Jurassic World  502177271
11         Titanic  458672302

7. _What are the average budget of all movies in dataset in 2015?_

In [73]:
imdb2015 = imdb[imdb.title_year==2015]

In [81]:
import statistics

In [92]:
budget2015=statistics.mean(imdb2015.budget_USD)
budget2015

52102458.333333336

8. _What are the average budget of all movies in dataset in 2016?_

In [91]:
imdb2016 = imdb[imdb.title_year==2016]
budget2016 = statistics.mean(imdb2016.budget_USD)
budget2016

66014754.09836066

9._Which one is higher, average budget of all movies in dataset in 2016 or 2017?_

In [94]:
if budget2015 > budget2016:
    print ('2015')
else:
    print ('2016')

2016

10. _What movie that resulted highest nett profit of all dataset times? How much did the movie make?_

In [96]:
imdbprofit.head(1)[['movie_title','net_USD']]

  movie_title    net_USD
0      Avatar  523505847